# ВВПД Практическая №5. Документация программиста
## Find Palindrome

Все мы сталкивались с проблемой нахождения [палиндрома](https://ru.wikipedia.org/wiki/Палиндром) числа путем суммирования этого числа с самим собой. Годами люди трудились, бились головами, просили Бога, заключали сделки с демонами, проводили годы, медитируя, но ни один из них даже не приблизился к тому, чтобы узнать как написать программу, которая будет искать палиндромы. Со временем люди утратили веру в то, что это возможно, но случилось событие масштабы которого сопоставимы со [вторым пришествием Иисуса](https://en.wikipedia.org/wiki/Second_Coming) - в интернете появился код, который полностью отвечает необходимым требованиям. Были смельчаки, который не верили этому, отрицали, пытались доказать, что это невозможно, говорили: "*Погоидите, это реально?*". Отвечаю всем им: "*Да, это реально*" и подкрепляю свои слова этим проектом. При помощи этого кода, написанного на языке программирования **PYTHON** вы можете:

* Проводить время с пользой, изучая палиндромы чисел.
* Решать задачи на нахождение палиндрома
* Читать документацию к этому коду

Ниже можно увидеть плане разработчика, можно заметить, что выполнены почти все пункты, что вызывает уважение к программисту.
- [x] Написать код
- [x] Написать документацию
- [x] Написать README файл
- [x] Анжумания
- [x] Посмотреть 10 серию Человека-Бензопилы
- [ ] Купить комбо-усилитель для новой бас гитары
- [ ] Сдать экзамен по ВВПД (ну или хотя бы все практические)
 
 Я понимаю, что каждому читателю уже нетерпится посмотретья на это гениальное творение, поэтому необходимо перестать чесать языком и начать демонстрировать код.
 
 ## Демонстрация кода
Ниже внимательный читатель может увидеть сердце программы - алгоритм нахождения палиндрома числа.
```python
for n in range(iteration_count + 1):
    if str(palindrome) == str(palindrome)[::-1]:
        print(f"Палиндром - {palindrome}. Число итераций: {n}")
        return True
    palindrome = str(int(palindrome) + int(str(palindrome)[::-1]))
else:
    print("Палиндром не найден")
    return False
```
Ниже видно мое фото, если вы не верите, что это все сделал я, то взгляните на меня. Разве я могу врать?

